Revit 2027 API
OrdinateTextOrientation Enumeration
 The ordinate dimension text orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OrdinateTextOrientation
Public Enumeration OrdinateTextOrientation
public enum class OrdinateTextOrientation
type OrdinateTextOrientation
Members
Member name | Value | Description
ParallelToDimensionLine | 0 |  The dimension text orientation will be parallel to dimension line.
ParallelToWitnessLine | 1 |  The dimension text orientation will be parallel to witness line.
See Also
Reference
Autodesk.Revit.DB Namespace